src/DataProcessors/СозданиеРеализацииДляВыгрузкиВБухгалтерию/СозданиеРеализацииДляВыгрузкиВБухгалтерию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СозданиеРеализацииДляВыгрузкиВБухгалтерию</name>
  <attributes>
    <name>НаДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/AccumulationRegisters/МестаХранения/МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>МестаХранения</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМПЗ</name>
    <type>
      <types>EnumRef.ВидыМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыМПЗ/ВидыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМПЗ</name>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикаты</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Реализация/Реализация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Реализация</name>
  <basedOn>Document.ЗаявкаОтПокупателя</basedOn>
  <basedOn>Document.ПоступлениеМПЗ</basedOn>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.Долги</registerRecords>
  <registerRecords>AccumulationRegister.ЗаявкиОтПокупателей</registerRecords>
  <attributes>
    <name>Внутренняя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэфф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерУПД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПолучатель</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьГТД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидТовара</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/СозданиеРеализацииДляВыгрузкиВБухгалтерию/Forms/Форма/Module.bsl
&НаСервере
Функция СоздатьНаСервере()
Запрос = Новый Запрос;
ТЗ = Новый ТаблицаЗначений;

	Попытка
	Реализация = Документы.Реализация.СоздатьДокумент();
	Реализация.Внутренняя = Истина;
	Реализация.Дата = ТекущаяДата();
	Реализация.Подразделение = Подразделение;
	Реализация.ПодразделениеПолучатель = ПодразделениеПолучатель;
	Реализация.МестоХранения = МестоХраненияГП;
	Реализация.Контрагент = Контрагент; 
	Реализация.Договор = Договор;
	Реализация.Коэфф = 1;
		Если СоздаватьИз = 1 Тогда
		Реализация.Комментарий = "Передачи на склады линеек со склада ГП УЛиШИ за период с "+НачалоДня(Объект.НаДату)+" по "+КонецДня(Объект.НаДату);
		Иначе 	
		Реализация.Комментарий = "Перемещения со склада ГП УЛиШИ на склады подразделения "+СокрЛП(ПодразделениеПолучатель.Наименование)+" за период с "+НачалоДня(Объект.НаДату)+" по "+КонецДня(Объект.НаДату);
		КонецЕсли;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МестаХраненияОбороты.Регистратор,
		|	МестаХраненияОбороты.МПЗ,
		|	МестаХраненияОбороты.КоличествоРасход
		|ИЗ
		|	РегистрНакопления.МестаХранения.Обороты(&ДатаНач, &ДатаКон, Регистратор, ) КАК МестаХраненияОбороты
		|ГДЕ
		|	МестаХраненияОбороты.ВидМПЗ = &ВидМПЗ
		|	И МестаХраненияОбороты.МестоХранения = &МестоХранения";
	Запрос.УстановитьПараметр("МестоХранения",МестоХраненияГП); 
	Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Объект.НаДату)); 
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(Объект.НаДату)); 
		Если ВидМПЗ = 1 Тогда
		Запрос.УстановитьПараметр("ВидМПЗ",Перечисления.ВидыМПЗ.Материалы);
		Иначе	
		Запрос.УстановитьПараметр("ВидМПЗ",Перечисления.ВидыМПЗ.Полуфабрикаты);
		КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если СоздаватьИз = 1 Тогда	
				Если ТипЗнч(Выборка.Регистратор) <> Тип("ДокументСсылка.ПередачаНаЛинейку") Тогда	
				Продолжить;
				КонецЕсли;
					Если Выборка.Регистратор.МестоХраненияКанбанов.Подразделение <> ПодразделениеПолучатель Тогда
					Продолжить;
					КонецЕсли;
			Иначе
				Если ТипЗнч(Выборка.Регистратор) <> Тип("ДокументСсылка.ДвижениеМПЗ") Тогда
				Продолжить;
				КонецЕсли;
					Если Выборка.Регистратор.МестоХраненияВ.Подразделение <> ПодразделениеПолучатель Тогда
					Продолжить;
					КонецЕсли; 
			КонецЕсли;  
		ТЧ = Реализация.ТабличнаяЧасть.Добавить();
			Если ВидМПЗ = 1 Тогда
			ТЧ.ВидТовара = Перечисления.ВидыМПЗ.Материалы;
			Иначе
			ТЧ.ВидТовара = Перечисления.ВидыМПЗ.Полуфабрикаты;
			КонецЕсли;  
		ТЧ.Товар = Выборка.МПЗ;
		ТЧ.ЕдиницаИзмерения = ТЧ.Товар.ОсновнаяЕдиницаИзмерения;
		ТЧ.Количество = Выборка.КоличествоРасход/ТЧ.ЕдиницаИзмерения.Коэффициент;
		КонецЦикла;	
			Если Реализация.ТабличнаяЧасть.Количество() > 0 Тогда
			ТЗ = Реализация.ТабличнаяЧасть.Выгрузить();
			ТЗ.Свернуть("ВидТовара,Товар,ЕдиницаИзмерения","Количество");
			ТЗ.Сортировать("Товар");
			Реализация.ТабличнаяЧасть.Загрузить(ТЗ);
				Для каждого ТЧ Из Реализация.ТабличнаяЧасть Цикл
				ТЧ.Цена = ОбщийМодульРаботаСРегистрами.ПолучитьЦенуДП(Реализация.Договор,1,ТЧ.Товар,Объект.НаДату);
					Если ТЧ.Цена = 0 Тогда
					Сообщить(СокрЛП(ТЧ.Товар.Наименование)+" - договорная позиция не найдена!");		
					КонецЕсли; 
				ТЧ.Сумма = ТЧ.Цена*ТЧ.Количество;	
					Если Реализация.Договор.БезНДС Тогда
					ТЧ.СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
					ТЧ.НДС = 0;
					ТЧ.Всего = ТЧ.Сумма;
					Иначе
					ТЧ.СтавкаНДС = Константы.ОсновнаяСтавкаНДС.Получить();
					ТЧ.НДС = ТЧ.Сумма*ТЧ.СтавкаНДС.Ставка/100;
					ТЧ.Всего = ТЧ.Сумма + ТЧ.НДС;		
					КонецЕсли;
				КонецЦикла; 
			Реализация.Записать(РежимЗаписиДокумента.Запись);
			Возврат(Реализация.Ссылка);
			Иначе
			Сообщить("Табличная часть документа реализации пустая! Документ не создан!");
			Возврат(Документы.Реализация.ПустаяСсылка());
			КонецЕсли; 
	Исключение
	Сообщить(ОписаниеОшибки());
	Возврат(Документы.Реализация.ПустаяСсылка());
	КонецПопытки;
КонецФункции

&НаКлиенте
Процедура Создать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	Результат = СоздатьНаСервере();
		Если Не Результат.Пустая() Тогда	
		ПоказатьОповещениеПользователя("ВНИМАНИЕ!",ПолучитьНавигационнуюСсылку(Результат),"Создан документ "+Результат,БиблиотекаКартинок.Пользователь,СтатусОповещенияПользователя.Информация);		
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ВидМПЗ = 1;
СоздаватьИз = 1;
Объект.НаДату = ТекущаяДата();
КонецПроцедуры
